2017年3月18日23:41:34

心里有很多事，想说，却不知从何说起。

当她的志愿毅然的选择长春那一刻，似乎我的命运 和 ACM已经联系在了一起。

在第一次听ACM宣讲时，感觉正能量，欣然向往。

高中时，悬崖勒马，可惜为时已晚，但我不悔。

可以说，我的性格 有百分之五十 继承于 我的父亲。
百分之三十，源自于母亲的泪水。
百分之十，成长带来的影响，以及她的到来。

于是乎，我变了，懂事了。

虽然说，从回头那一刻之后，不断怒=努力，却一直失败。

但我一直在战胜自己，惰性，好玩，思想的转变。

高三的日子很苦，尤其是对于 我这种初学者。

每天五半点起床，零晨睡觉，一直学。

但是，从初中落下的物理化学，却怎么补也上不了。

初中？你可能说，全是因为环境所致，呵，真的是吗。

为何要在乎他人的看法。马进，你自己的心呢。

一时的选择，可能决定你的一生。

但是无所谓，在经过五年的混蛋，终于能醒悟。

谢谢母亲，以后再也不会让你哭。

高考败了。

你洋洋自喜，进步很大。

但是别忘了，从一开始，你便是一个失败者。

现在给你的，只有不断的努力，为了亲人，为了自己，也为了她。

她负过你。

无所谓吗？

无所谓了。

现在，我大一下半年。

我有的是无限的精力 和 拼劲。

现在，我被告知 我被选为次强队员，代表学校去参赛。

害怕，有压力，自卑。

怎么办。

我不知道。

比赛时，犹如智障。

心态对于我来说真是个问题。

我很明白。

自己需要磨练。

是的，我一直需要磨练。

从小 被老师，同学嘲笑，欺负。

自卑。

初中，三好生为什么不选全校第一，而大家却选坏学生。

为什么班主任通知我家长说，我内向。

那好，从今以后，我会成为 你们最喜欢的样子。

和坏孩子混。

混来混去，被伤的还是自己。

被揍了，朋友全跑，出事了，自己背锅。

对象呢，拼尽所有，然后跑了。

高中还是不懂，一周两次叫家长。

母亲 受不了这气。

受了很多委屈。

最后，母亲在一次回家反省时哭着对我说：你无论如何也要把这学上下来，无论花多钱。

你可能觉得我从那时，我变了。

其实我也不知道。

慢慢的，不注意外表，上课听讲，拒了一些朋友邀请。

慢慢的，一次次考试的失落，努力的学习。

从全校200开外进到了前25

哈，毕业那天，老班哭的像个傻逼

毕业了。

打工。

一个月后。

一分钱没赚。

社会黑暗。

有很多，换死货的情况，我受不了，跑了。

跑了二三家，最后发现全是这样。

我光着屁股回家了。

高考志愿开始了。

我们异地恋。

每次她放假，我都会以各种方法去找她。

约了很久一个约定。

到最后她还是选择了外地。

我不敢揣测她的真正想法。

因为我知道，我离不开她了。

最后，志愿结束前，去网吧把志愿偷着改了。

当录取结果出来时，

我不知道，母亲哭了有多久。

对不起，母亲。

我会好好对你的。

现在，凌晨，我在电脑面前，说些破事。

原来想写点励志的屁话，鼓励自己。

也不知道，怎么说了这么多，可能憋了太久了吧。

哈。

是的，参加ACM半年之久。

从刚开始选拔第8名，一直慢慢走到现在。

我要感谢。

谢谢森哥，康瑞，我的队友们，谢谢陈老师，于老师，周老师给我的环境，谢谢裴育学长，丁创豪学长，杨福康学长授予我的知识....还有很多人，我可爱的舍友们。

昨天聚会喝酒，两瓶我就多了，他们那群禽兽，不愧是东北人。。最后我像个傻逼似的。。

又偏了。

经过半年ACM的历练，真的让我收获很多。

现在，过几天就要去比赛了，团队赛。

一人GG，全队GG。
无论如何，一定发挥出自己的训练水平。

那样，你就已经赢了。








